app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["body", "Some body"], ["created_at", "2026-08-18 22:49:30.625482"], ["title", "New post"], ["updated_at", "2026-08-18 22:49:30.625482"]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def create
    @post = Post.new(post_params)

    if @post.save
      redirect_to root_path, notice: "Post created."
    else
      @posts = Post.order(created_at: :desc)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 980190962]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def destroy
    Post.find(params[:id]).destroy